import telebot
from telebot import types

#cities
city_list = ["🔸 Казань 🔸","🔸 Пермь 🔸","🔸 Новосибирск 🔸","🔸 Челябинск 🔸","🔸 Москва 🔸","🔸 Санкт-Петербург 🔸","🔸 Тула 🔸","🔸 Екатеринбрг 🔸","🔸 Барнаул 🔸","🔸 Томск 🔸","🔸 Тюмень 🔸","🔸 Нижний Новгород 🔸","🔸 Самара 🔸","🔸 Омск 🔸","🔸 Саратов 🔸","🔸 Краснодар 🔸","🔸 Воронеж 🔸", "🔸 Екатеринбург 🔸", "🔸 Волгоград 🔸", "🔸 Иваново 🔸", "🔸 Тольятти 🔸", "🔸 Уфа 🔸", "🔸 Красноярск 🔸","🔸 Астрахань 🔸","🔸 Великий Новгород 🔸","🔸 Владивосток 🔸","🔸 Вологда 🔸","🔸 Ижевск 🔸","🔸 Йошкар-Ола 🔸","🔸 Калининград 🔸","🔸 Калуга 🔸","🔸 Кемерово 🔸","🔸 Киров 🔸","🔸 Курск 🔸","🔸 Мурманск 🔸","🔸 Набережные челны 🔸","🔸 Нижневартовск 🔸","🔸 Новокузнецк 🔸","🔸 Оренбург 🔸","🔸 Орел 🔸","🔸 Пенза 🔸","🔸 Ростов-на-Дону 🔸","🔸 Саранск 🔸","🔸 Ульяновск 🔸","🔸 Иркутск 🔸","🔸 Хабаровск 🔸","🔸 Ярославль 🔸","🔸 Рязань 🔸","🔸 Липецк 🔸","🔸 Чебоксары 🔸","🔸 Ставрополь 🔸","🔸 Севастополь 🔸","🔸 Сочи 🔸","🔸 Тверь 🔸","🔸 Брянск 🔸","🔸 Белгород 🔸","🔸 Владиимр 🔸","🔸 Чита 🔸","🔸 Смоленск 🔸","🔸 Якутск 🔸","🔸 Череповец 🔸","🔸 Тамбов 🔸","🔸 Петрозаводск 🔸","🔸 Абакан 🔸","🔸 Южно-Сахалинск 🔸"]
rayon_list = ["🔸 САО 🔸","🔸 ЦАО 🔸","🔸 ЮАО 🔸","🔸 ЮВАО 🔸","🔸 ЗАО 🔸","🔸 Василеостровский 🔸","🔸 Выборгский 🔸","🔸 Калининский 🔸","🔸 Кировский 🔸","🔸 Колпинский 🔸","🔸 Красногвардейский 🔸","🔸 Красносельский 🔸","🔸 Курортный","🔸 Кронштадтский 🔸","🔸 Московский 🔸","🔸 Невский 🔸","🔸 Петроградский 🔸","🔸 Петродворцовый 🔸","🔸 Приморский 🔸","🔸 Пушкинский 🔸","🔸 Фрунзенский 🔸","🔸 Центральный 🔸",
              "🔸 Зареченский 🔸","🔸 Привокзальный 🔸","🔸 Пролетарский 🔸","🔸 Советский 🔸","🔸 Центральный 🔸","🔸 Верх-Исетский 🔸","🔸 Железнодорожный 🔸","🔸 Кировский 🔸","🔸 Октябрьский 🔸","🔸 Ордожиникидзевский 🔸","🔸 Чкаловский 🔸", "🔸 Железнодорожный 🔸","🔸 Индустриальный 🔸","🔸 Ленинский 🔸","🔸 Октябрьский","🔸 Кировский 🔸","🔸 Ленинский 🔸","🔸 Октрябрьский 🔸","🔸 Советский 🔸",
              "🔸 Восточный 🔸","🔸 Ленинский 🔸", "🔸 Автозаводский 🔸","🔸 Канавинский 🔸","🔸 Нижегородский 🔸","🔸 Приокский 🔸", "🔸 Сормовский 🔸", "🔸 Куйбышевский 🔸","🔸 Самарский 🔸","🔸 Промышленный 🔸","🔸 Красноглинский 🔸", "🔸 Заводской район 🔸","🔸 Фрунзенский 🔸","🔸 Волжский 🔸", "🔸 ЖМР 🔸","🔸 СМР 🔸","🔸 ЗИП 🔸","🔸 РИП 🔸","🔸 ШМР 🔸","🔸 ЮМР 🔸","🔸 КМР 🔸","🔸 ПМР 🔸","🔸 ГМР 🔸","🔸 ЧМР 🔸",
              "🔸 Железнодорожный 🔸","🔸 Коминтерновский 🔸","🔸 Левобережный 🔸","🔸 Авиастроительный 🔸","🔸 Вахитовский 🔸","🔸 Ново-Савиновский 🔸","🔸 Приволжский 🔸","🔸 Дзержинский 🔸","🔸 Мотовилихинский 🔸","🔸 Орджоникидзевский 🔸","🔸 Свердловский 🔸","🔸 Дзержинский 🔸","🔸 Заельцовский 🔸","🔸 Первомайский 🔸","🔸 Курчатовский 🔸","🔸 Металлургический 🔸","🔸 Тракторозаводской 🔸",
              "🔸 Краснооктябрьский 🔸", "🔸 Дзержинский 🔸", "🔸 Ворошиловский 🔸", "🔸 Красноармейский 🔸", "🔸 Железнодорожный 🔸", "🔸 Свердловский 🔸", "🔸 Автозаводский 🔸", "🔸 Комсомольский 🔸", "🔸 Дёмский 🔸", "🔸 Калининский 🔸", "🔸 Орджоникидзевский 🔸", "🔸 Кировский 🔸","🔸 Трусовский 🔸","🔸 Приволжский 🔸","🔸 Ближний пригород 🔸","🔸 Восток 🔸","🔸 Север 🔸","🔸 Запад 🔸","🔸 северо - запад 🔸","🔸 Первомайский 🔸","🔸 Ленинский 🔸","🔸 Первореченский 🔸","🔸 Советский 🔸","🔸 По городу 🔸","🔸 Водники 🔸",
              "🔸 Зареье 🔸","🔸 Завокзальный 🔸","🔸 Октябрьский 🔸","🔸 Нагорный 🔸","🔸 Северный 🔸","🔸 Юбилейный 🔸","🔸 Балтийский 🔸""🔸 Московский 🔸","🔸 Октябрьский 🔸",
              "🔸 Центральный 🔸","🔸 Московский округ 🔸","🔸 Октябрьский округ 🔸","🔸 Центр 🔸","🔸 Кировский 🔸","🔸 Ближний пригород +5 км 🔸","🔸 Южный 🔸","🔸 Центр 🔸","🔸 Кировский 🔸","🔸 ТЭЦ 🔸","🔸 Филейка 🔸","🔸 Жд вокзал 🔸",
              "🔸 В черте города 🔸","🔸 Жд 🔸","🔸 Сеймский 🔸","🔸 Центральный 🔸","🔸 Пригород 🔸","🔸 Октябрьский 🔸","🔸 Первомайский 🔸","🔸 Петушинка 🔸","🔸 Центр 🔸","🔸 Тогаевский карьер 🔸","🔸 36 комплекс 🔸","🔸 Энергорайон 🔸","🔸 10 комплекс 🔸","🔸 Молодежный 🔸","🔸 Северный 🔸","🔸 Центральный 🔸","🔸 По городу 🔸","🔸 Заводской 🔸","🔸 Орджоникидзе 🔸","🔸 Центр 🔸","🔸 В городе 🔸","🔸 Степной 🔸","🔸 Центральный 🔸","🔸 23мкр 🔸",
              "🔸 В черте города 🔸","🔸 Восточный 🔸","🔸 Северный 🔸","🔸 Советский 🔸","🔸 Лужки 🔸","🔸 Гринн 🔸","🔸 Жд 🔸","🔸 Ленинский 🔸","🔸 Первомайский 🔸","🔸 Октябрьский 🔸","🔸 Кировский 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Первомайский 🔸","🔸 Октябрьский 🔸","🔸 Ленинский 🔸","🔸 Пролетарский 🔸","🔸 Первомайский 🔸","🔸 Октябрьский 🔸","🔸 Ленинский 🔸","🔸 Индустриальный 🔸","🔸 Ленинский 🔸","🔸 Заволжский 🔸","🔸 Железнодорожный 🔸","🔸 В черте города 🔸","🔸 Кировский 🔸","🔸 Куйбышевский 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Свердловский 🔸","🔸 Краснофлотский 🔸","🔸 Кировский 🔸","🔸 Центральный 🔸","🔸 Железнодорожный 🔸","🔸 Индустриальный 🔸","🔸 Дзержинский 🔸","🔸 Ленинский 🔸","🔸 Кировский 🔸","🔸 Фрунзенский 🔸","🔸 Железнодорожный 🔸","🔸 Московский 🔸","🔸 Октябрьский 🔸","🔸 Советский 🔸",
              "🔸 Левобережный район 🔸","🔸 Октябрьский район 🔸","🔸 Правобережный район 🔸","🔸 Советский район 🔸","🔸 Железнодорожный 🔸","🔸 Московский 🔸","🔸 Октябрьский 🔸","🔸 Советский 🔸","🔸 Калининский район 🔸","🔸 Ленинский район 🔸","🔸 Московский район 🔸","🔸 по всему городу 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Калининский 🔸","🔸 Адлерский 🔸","🔸 Хостинский 🔸","🔸 Лазоревский 🔸","🔸 Заволжский 🔸","🔸 Московский 🔸","🔸 Пролетарский 🔸","🔸 Центральный 🔸","🔸 Бежитский 🔸","🔸 Советский 🔸","🔸 Фокинский 🔸","🔸 Володарский 🔸","🔸 Восточный 🔸","🔸 Западный 🔸","🔸 По всему городу 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Фрунзенский 🔸","🔸 Черновский 🔸","🔸 Центральный 🔸","🔸 Железнодорожный 🔸","🔸 Ленинский 🔸","🔸 Промышленный 🔸","🔸 Заднепровский 🔸","🔸 Автодорожный округ 🔸","🔸 Гагаринский округ 🔸","🔸 Октябрьский округ 🔸","🔸 Индустриальный 🔸","🔸 Заягорбский 🔸","🔸 Зашекснинский 🔸","🔸 Фанера 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Севетский 🔸","🔸 Голиковка �","🔸 Древлянка 🔸","🔸 Железнодорожный 🔸","🔸 Зарека 🔸","🔸 МПС 🔸","🔸 Южный 🔸","🔸 Красный Абакан 🔸","🔸 Гавань 🔸","🔸 Марковка 🔸","🔸 Змеевка 🔸","🔸 Зима 🔸"
             ]
tovar_list = { "🔸 Гашиш (1гр) - 950p 🔸" : "950","🔸 Гашиш (5гр) - 4400p 🔸" : "4400","🔸 Гашиш (10гр) - 8500p 🔸" : "8500","🔸 Шишки (1гр) - 1100p 🔸" : "1100","🔸 Шишки (2гр) - 2000p 🔸" : "2000",
"🔸 Шишки (5гр) - 3500p 🔸" : "3500","🔸 Шишки (10гр) - 6500p 🔸" : "6500","🔸 Амфетамин (1гр) - 800p 🔸": "800","🔸 Амфетамин (3гр) - 2100p 🔸" : "2100","🔸 Амфетамин (5гр) - 3000p 🔸" : "3000",
"🔸 Амфетамин (10гр) - 5500p 🔸" : "5500","🔸 Амфетамин (25гр) - 10000p 🔸" : "10000","🔸 Мефедрон (1гр) - 1300p 🔸" : "1300p","🔸 Мефедрон (3гр) - 3700p 🔸" : "3700",
"🔸 МДМА (1гр) - 2800p 🔸" : "2800","🔸 МДМА (2гр) - 5600p 🔸" : "5600","🔸 МДМА (5гр) - 11600p 🔸" : "11600","🔸 Кокаин MQ (1гр) - 3850p 🔸" : "3850","♦️ Кокаин HQ (0,3гр)-2500p" : "2500",
"🔸 Кокаин HQ (1гр) - 7500p 🔸" : "7500","🔸 Кокаин HQ (0,5гр) - 4250p 🔸" : "4250","🔸 Кокаин HQ (1,5гр) - 11400p 🔸" : "11400","🔸 Кокаин MQ (2гр) - 8650p 🔸" : "8650",
"🔸 LSD(180мкг) (5шт) - 3500p 🔸" : "3500","🔸 LSD(180мкг) (10шт) - 7700p 🔸" : "7700","🔸 Метамфетамин HQ(Крис) (1гр) - 3400p 🔸" : "3400", "🔸 Экстази (Таблетки Philipp Plein) (3шт) - 1350р 🔸" : "1350", 
"🔸 Экстази (Таблетки Philipp Plein) (6шт) - 4000р 🔸": "4000", "🔸 Бутират (30 мл) - 600р 🔸" : "600", "🔸 Бутират (100 мл) - 1950р 🔸" : "1950","🔸 Гидропоника [The Cake] (1гр) - 2350р 🔸" : "2350",
"🔸 Альфа-ПВП (0,2гр) - 699р 🔸":"699","🔸 Альфа-ПВП (0,5гр) - 1299р 🔸": "1299", "🔸 Альфа-ПВП (1гр) - 2499р 🔸" : "2499", "🔸 Бошки Cookies Kush (1гр) - 1800р 🔸" : "1800", "🔸 Бошки Cookies Kush (3гр) - 5350р 🔸" : "5350", 
"🔸 Бошки Cookies Kush (5гр) - 8900р 🔸" : "8900", "🔸 Метамфетамин HQ(Крис) (2гр) - 6750p 🔸": "6750", "🔸 Гидропоника [The Cake] (2гр) - 4650р 🔸" : "4650", "🔸 Гидропоника [The Cake] (2,5гр) - 5285р 🔸" : "5285", 
"🔸 LSD(180мкг) (2шт) - 700р 🔸" : "700" }

all_list = ['📨 Информация 📨', '😍 Акции 😍', '🤑 Скидки 🤑', '👨\u200d👨\u200d👦 Реферальная система 👨\u200d👨\u200d👦', '❓ Как совершить покупку ❓', '🔜 Перейти к выбору товара 🔜', '🔙 Вернуться к выбору города 🔙', '🧮 Проверить оплату 🧮', '🔙 Вернуться к выбору товара 🔙', '📦 Купить товар 📦',
'🔸 Казань 🔸', '🔸 Пермь 🔸', '🔸 Новосибирск 🔸', '🔸 Челябинск 🔸', '🔸 Москва 🔸', '🔸 Санкт-Петербург 🔸', '🔸 Тула 🔸', '🔸 Екатеринбург 🔸', '🔸 Барнаул 🔸', '🔸 Томск 🔸', '🔸 Тюмень 🔸', '🔸 Нижний Новгород 🔸', '🔸 Самара 🔸', '🔸 Омск 🔸', '🔸 Саратов 🔸', '🔸 Краснодар 🔸', '🔸 Воронеж 🔸', '🔸 Уфа 🔸', '🔸 Волгоград 🔸', '🔸 Иваново 🔸', '🔸 Тольятти 🔸', '🔸 Красноярск 🔸',
'🔸 САО 🔸', '🔸 ЦАО 🔸', '🔸 ЮАО 🔸', '🔸 ЮВАО 🔸', '🔸 ЗАО 🔸', '🔸 Василеостровский 🔸', '🔸 Выборгский 🔸', '🔸 Калининский 🔸', '🔸 Кировский 🔸', '🔸 Колпинский 🔸', '🔸 Красногвардейский 🔸', '🔸 Красносельский 🔸', '🔸 Курортный', '🔸 Кронштадтский 🔸', '🔸 Московский 🔸', '🔸 Невский 🔸', '🔸 Петроградский 🔸', '🔸 Петродворцовый 🔸', '🔸 Приморский 🔸', '🔸 Пушкинский 🔸', '🔸 Фрунзенский 🔸', '🔸 Центральный 🔸', '🔸 Зареченский 🔸', '🔸 Привокзальный 🔸', '🔸 Пролетарский 🔸', '🔸 Советский 🔸', '🔸 Центральный 🔸', '🔸 Верх-Исетский 🔸', '🔸 Железнодорожный 🔸', '🔸 Кировский 🔸', '🔸 Октябрьский 🔸', '🔸 Ордожиникидзевский 🔸', '🔸 Чкаловский 🔸', '🔸 Железнодорожный 🔸', '🔸 Индустриальный 🔸', '🔸 Ленинский 🔸', '🔸 Октябрьский', '🔸 Кировский 🔸', '🔸 Ленинский 🔸', '🔸 Октрябрьский 🔸', '🔸 Советский 🔸', '🔸 Восточный 🔸', '🔸 Ленинский 🔸',
'🔸 Автозаводский 🔸', '🔸 Канавинский 🔸', '🔸 Нижегородский 🔸', '🔸 Приокский 🔸', '🔸 Сормовский 🔸', '🔸 Куйбышевский 🔸', '🔸 Самарский 🔸', '🔸 Промышленный 🔸', '🔸 Красноглинский 🔸', '🔸 Заводской район 🔸', '🔸 Фрунзенский 🔸', '🔸 Волжский 🔸', '🔸 ЖМР 🔸', '🔸 СМР 🔸', '🔸 ЗИП 🔸', '🔸 РИП 🔸', '🔸 ШМР 🔸', '🔸 ЮМР 🔸', '🔸 КМР 🔸', '🔸 ПМР 🔸', '🔸 ГМР 🔸', '🔸 ЧМР 🔸', '🔸 Железнодорожный 🔸', '🔸 Коминтерновский 🔸', '🔸 Левобережный 🔸', '🔸 Авиастроительный 🔸', '🔸 Вахитовский 🔸', '🔸 Ново-Савиновский 🔸', '🔸 Приволжский 🔸', '🔸 Дзержинский 🔸', '🔸 Мотовилихинский 🔸', '🔸 Орджоникидзевский 🔸', '🔸 Свердловский 🔸', '🔸 Дзержинский 🔸', '🔸 Заельцовский 🔸', '🔸 Первомайский 🔸', '🔸 Курчатовский 🔸', '🔸 Металлургический 🔸', '🔸 Тракторозаводской 🔸', '🔸 Краснооктябрьский 🔸', '🔸 Дзержинский 🔸', '🔸 Ворошиловский 🔸', '🔸 Красноармейский 🔸',
'🔸 Железнодорожный 🔸', '🔸 Свердловский 🔸', '🔸 Автозаводский 🔸', '🔸 Комсомольский 🔸', '🔸 Дёмский 🔸', '🔸 Калининский 🔸', '🔸 Орджоникидзевский 🔸', '🔸 Гашиш (1гр) - 950p 🔸', '🔸 Гашиш (5гр) - 4400p 🔸', '🔸 Гашиш (10гр) - 8500p 🔸', '🔸 Шишки (1гр) - 1100p 🔸', '🔸 Шишки (2гр) - 2000p 🔸', '🔸 Шишки (5гр) - 3500p 🔸', '🔸 Шишки (10гр) - 6500p 🔸', '🔸 Амфетамин (1гр) - 800p 🔸', '🔸 Амфетамин (3гр) - 2100p 🔸', '🔸 Амфетамин (5гр) - 3000p 🔸', '🔸 Амфетамин (10гр) - 5500p 🔸', '🔸 Амфетамин (25гр) - 10000p 🔸', '🔸 Мефедрон (1гр) - 1300p 🔸', '🔸 Мефедрон (3гр) - 3700p 🔸', '🔸 МДМА (1гр) - 2800p 🔸', '🔸 МДМА (2гр) - 5600p 🔸', '🔸 МДМА (5гр) - 11600p 🔸', '🔸 Кокаин MQ (1гр) - 3850p 🔸', '♦️ Кокаин HQ (0,3гр)-2500p', '🔸 Кокаин HQ (1гр) - 7500p 🔸', '🔸 Кокаин HQ (0,5гр) - 4250p 🔸', '🔸 Кокаин HQ (1,5гр) - 11400p 🔸', '🔸 Кокаин MQ (2гр) - 8650p 🔸', '🔸 LSD(180мкг) (5шт) - 3500p 🔸',
'🔸 LSD(180мкг) (10шт) - 7700p 🔸', '🔸 Метамфетамин HQ(Крис) (1гр) - 3400p 🔸', '🔸 Экстази (Таблетки Philipp Plein) (3шт) - 1350р 🔸', '🔸 Экстази (Таблетки Philipp Plein) (6шт) - 4000р 🔸', '🔸 Бутират (30 мл) - 600р 🔸', '🔸 Альфа-ПВП (0,2гр) - 699р 🔸', '🔸 Бутират (100 мл) - 1950р 🔸', '🔸 Гидропоника [The Cake] (1гр) - 2350р 🔸', '🔸 Альфа-ПВП (0,5гр) - 1299р 🔸', '🔸 Альфа-ПВП (1гр) - 2499р 🔸', "🔸 LSD(180мкг) (2шт) - 700р 🔸", "🏎 Быстрая оплата 🏎",
'🔸 Альфа-ПВП 🔸',"🔸 Гашиш 🔸", "🔸 Шишки АК-47 🔸","🔸 Амфетамин 🔸","🔸 Мефедрон 🔸","🔸 МДМА 🔸","🔸 Кокаин 🔸","🔸 LSD 🔸","🔸 Метамфетамин 🔸","🔸 Экстази 🔸","🔸 Бутират 🔸","🔸 Гидропоника 🔸","🔸 Бошки Cookies Kush (1гр) - 1800р 🔸","🔸 Бошки Cookies Kush (3гр) - 5350р 🔸","🔸 Бошки Cookies Kush (5гр) - 8900р 🔸","🔸 Бошки Cookies Kush 🔸", "🔙 Вернуться в меню 🔙", "🔙 Назад 🔙", "🔸 Метамфетамин HQ(Крис) (2гр) - 6750p 🔸", "🔸 Гидропоника [The Cake] (2гр) - 4650р 🔸", "🔸 Гидропоника [The Cake] (2,5гр) - 5285р 🔸", "🔸 Кировский 🔸","🔸 Трусовский 🔸","🔸 Приволжский 🔸","🔸 Ближний пригород 🔸","🔸 Восток 🔸","🔸 Север 🔸","🔸 Запад 🔸","🔸 северо - запад 🔸","🔸 Первомайский 🔸","🔸 Ленинский 🔸","🔸 Первореченский 🔸","🔸 Советский 🔸","🔸 По городу 🔸","🔸 Водники 🔸",
"🔸 Зареье 🔸","🔸 Завокзальный 🔸","🔸 Октябрьский 🔸","🔸 Нагорный 🔸","🔸 Северный 🔸","🔸 Юбилейный 🔸","🔸 Балтийский 🔸""🔸 Московский 🔸","🔸 Октябрьский 🔸",
"🔸 Центральный 🔸","🔸 Московский округ 🔸","🔸 Октябрьский округ 🔸","🔸 Центр 🔸","🔸 Кировский 🔸","🔸 Ближний пригород +5 км 🔸","🔸 Южный 🔸","🔸 Центр 🔸","🔸 Кировский 🔸","🔸 ТЭЦ 🔸","🔸 Филейка 🔸","🔸 Жд вокзал 🔸",
"🔸 В черте города 🔸","🔸 Жд 🔸","🔸 Сеймский 🔸","🔸 Центральный 🔸","🔸 Пригород 🔸","🔸 Октябрьский 🔸","🔸 Первомайский 🔸","🔸 Петушинка 🔸","🔸 Центр 🔸","🔸 Тогаевский карьер 🔸","🔸 36 комплекс 🔸","🔸 Энергорайон 🔸","🔸 10 комплекс 🔸","🔸 Молодежный 🔸","🔸 Северный 🔸","🔸 Центральный 🔸","🔸 По городу 🔸","🔸 Заводской 🔸","🔸 Орджоникидзе 🔸","🔸 Центр 🔸","🔸 В городе 🔸","🔸 Степной 🔸","🔸 Центральный 🔸","🔸 23мкр 🔸",
"🔸 В черте города 🔸","🔸 Восточный 🔸","🔸 Северный 🔸","🔸 Советский 🔸","🔸 Лужки 🔸","🔸 Гринн 🔸","🔸 Жд 🔸","🔸 Ленинский 🔸","🔸 Первомайский 🔸","🔸 Октябрьский 🔸","🔸 Кировский 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Первомайский 🔸","🔸 Октябрьский 🔸","🔸 Ленинский 🔸","🔸 Пролетарский 🔸","🔸 Первомайский 🔸","🔸 Октябрьский 🔸","🔸 Ленинский 🔸","🔸 Индустриальный 🔸","🔸 Ленинский 🔸","🔸 Заволжский 🔸","🔸 Железнодорожный 🔸","🔸 В черте города 🔸","🔸 Кировский 🔸","🔸 Куйбышевский 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Свердловский 🔸","🔸 Краснофлотский 🔸","🔸 Кировский 🔸","🔸 Центральный 🔸","🔸 Железнодорожный 🔸","🔸 Индустриальный 🔸","🔸 Дзержинский 🔸","🔸 Ленинский 🔸","🔸 Кировский 🔸","🔸 Фрунзенский 🔸","🔸 Железнодорожный 🔸","🔸 Московский 🔸","🔸 Октябрьский 🔸","🔸 Советский 🔸",
"🔸 Астрахань 🔸","🔸 Великий Новгород 🔸","🔸 Владивосток 🔸","🔸 Вологда 🔸","🔸 Ижевск 🔸","🔸 Йошкар-Ола 🔸","🔸 Калининград 🔸","🔸 Калуга 🔸","🔸 Кемерово 🔸","🔸 Киров 🔸","🔸 Курск 🔸","🔸 Мурманск 🔸","🔸 Набережные челны 🔸",
"🔸 Нижневартовск 🔸","🔸 Новокузнецк 🔸","🔸 Оренбург 🔸","🔸 Орел 🔸","🔸 Пенза 🔸","🔸 Ростов-на-Дону 🔸","🔸 Саранск 🔸","🔸 Ульяновск 🔸","🔸 Иркутск 🔸","🔸 Хабаровск 🔸","🔸 Ярославль 🔸","🔸 Рязань 🔸","🔸 Липецк 🔸","🔸 Чебоксары 🔸","🔸 Ставрополь 🔸","🔸 Севастополь 🔸","🔸 Сочи 🔸","🔸 Тверь 🔸","🔸 Брянск 🔸","🔸 Белгород 🔸","🔸 Владиимр 🔸","🔸 Чита 🔸","🔸 Смоленск 🔸","🔸 Якутск 🔸","🔸 Череповец 🔸","🔸 Тамбов 🔸","🔸 Петрозаводск 🔸","🔸 Абакан 🔸","🔸 Южно-Сахалинск 🔸","🔸 Левобережный район 🔸","🔸 Октябрьский район 🔸","🔸 Правобережный район 🔸","🔸 Советский район 🔸","🔸 Железнодорожный 🔸","🔸 Московский 🔸","🔸 Октябрьский 🔸","🔸 Советский 🔸","🔸 Калининский район 🔸","🔸 Ленинский район 🔸","🔸 Московский район 🔸","🔸 по всему городу 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Калининский 🔸","🔸 Адлерский 🔸","🔸 Хостинский 🔸","🔸 Лазоревский 🔸","🔸 Заволжский 🔸","🔸 Московский 🔸","🔸 Пролетарский 🔸","🔸 Центральный 🔸","🔸 Бежитский 🔸","🔸 Советский 🔸","🔸 Фокинский 🔸","🔸 Володарский 🔸","🔸 Восточный 🔸","🔸 Западный 🔸","🔸 По всему городу 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Фрунзенский 🔸","🔸 Черновский 🔸","🔸 Центральный 🔸","🔸 Железнодорожный 🔸","🔸 Ленинский 🔸","🔸 Промышленный 🔸","🔸 Заднепровский 🔸","🔸 Автодорожный округ 🔸","🔸 Гагаринский округ 🔸","🔸 Октябрьский округ 🔸","🔸 Индустриальный 🔸","🔸 Заягорбский 🔸","🔸 Зашекснинский 🔸","🔸 Фанера 🔸","🔸 Ленинский 🔸","🔸 Октябрьский 🔸","🔸 Севетский 🔸","🔸 Голиковка �","🔸 Древлянка 🔸","🔸 Железнодорожный 🔸","🔸 Зарека 🔸","🔸 МПС 🔸","🔸 Южный 🔸","🔸 Красный Абакан 🔸","🔸 Гавань 🔸","🔸 Марковка 🔸","🔸 Змеевка 🔸","🔸 Зима 🔸" ]

cities_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
cities_menu.row("🔸 Москва 🔸",)
cities_menu.row("🔸 Санкт-Петербург 🔸",)
cities_menu.row("🔸 Тула 🔸",)
cities_menu.row("🔸 Екатеринбург 🔸",)
cities_menu.row("🔸 Барнаул 🔸",)
cities_menu.row("🔸 Томск 🔸",)
cities_menu.row("🔸 Красноярск 🔸")
cities_menu.row("🔸 Иваново 🔸",)
cities_menu.row("🔸 Тольятти 🔸")
cities_menu.row("🔸 Уфа 🔸")
cities_menu.row("🔸 Тюмень 🔸",)
cities_menu.row("🔸 Нижний Новгород 🔸",)
cities_menu.row("🔸 Самара 🔸",)
cities_menu.row("🔸 Омск 🔸",)
cities_menu.row("🔸 Саратов 🔸",)
cities_menu.row("🔸 Краснодар 🔸",)
cities_menu.row("🔸 Воронеж 🔸",)
cities_menu.row("🔸 Казань 🔸",)
cities_menu.row("🔸 Пермь 🔸",)
cities_menu.row("🔸 Новосибирск 🔸",)
cities_menu.row("🔸 Челябинск 🔸",)
cities_menu.row("🔸 Волгоград 🔸")
cities_menu.row("🔸 Астрахань 🔸",)
cities_menu.row("🔸 Великий Новгород 🔸",)
cities_menu.row("🔸 Владивосток 🔸",)
cities_menu.row("🔸 Вологда 🔸",)
cities_menu.row("🔸 Ижевск 🔸",)
cities_menu.row("🔸 Йошкар-Ола 🔸",)
cities_menu.row("🔸 Калининград 🔸")
cities_menu.row("🔸 Калуга 🔸",)
cities_menu.row("🔸 Кемерово 🔸")
cities_menu.row("🔸 Киров 🔸")
cities_menu.row("🔸 Курск 🔸",)
cities_menu.row("🔸 Мурманск 🔸",)
cities_menu.row("🔸 Набережные челны 🔸",)
cities_menu.row("🔸 Нижневартовск 🔸",)
cities_menu.row("🔸 Новокузнецк 🔸",)
cities_menu.row("🔸 Оренбург 🔸",)
cities_menu.row("🔸 Орел 🔸",)
cities_menu.row("🔸 Пенза 🔸",)
cities_menu.row("🔸 Ростов-на-Дону 🔸",)
cities_menu.row("🔸 Саранск 🔸")
cities_menu.row("🔸 Ульяновск 🔸")
cities_menu.row("🔸 Иркутск 🔸")
cities_menu.row("🔸 Хабаровск 🔸",)
cities_menu.row("🔸 Ярославль 🔸",)
cities_menu.row("🔸 Рязань 🔸",)
cities_menu.row("🔸 Липецк 🔸")
cities_menu.row("🔸 Чебоксары 🔸")
cities_menu.row("🔸 Ставрополь 🔸",)
cities_menu.row("🔸 Севастополь 🔸",)
cities_menu.row("🔸 Сочи 🔸",)
cities_menu.row("🔸 Тверь 🔸",)
cities_menu.row("🔸 Брянск 🔸",)
cities_menu.row("🔸 Белгород 🔸",)
cities_menu.row("🔸 Владиимр 🔸",)
cities_menu.row("🔸 Чита 🔸",)
cities_menu.row("🔸 Смоленск 🔸",)
cities_menu.row("🔸 Якутск 🔸")
cities_menu.row("🔸 Череповец 🔸")
cities_menu.row("🔸 Тамбов 🔸")
cities_menu.row("🔸 Петрозаводск 🔸",)
cities_menu.row("🔸 Абакан 🔸",)
cities_menu.row("🔸 Южно-Сахалинск 🔸",)
cities_menu.row("🔙 Вернуться в меню 🔙")

kategorii_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
kategorii_menu.row("🔸 Альфа-ПВП 🔸",)
kategorii_menu.row("🔸 Гашиш 🔸",)
kategorii_menu.row("🔸 Шишки АК-47 🔸",)
kategorii_menu.row("🔸 Амфетамин 🔸",)
kategorii_menu.row("🔸 Мефедрон 🔸",)
kategorii_menu.row("🔸 МДМА 🔸",)
kategorii_menu.row("🔸 Кокаин 🔸",)
kategorii_menu.row("🔸 LSD 🔸",)
kategorii_menu.row("🔸 Метамфетамин 🔸",)
kategorii_menu.row("🔸 Экстази 🔸",)
kategorii_menu.row("🔸 Бутират 🔸",)
kategorii_menu.row("🔸 Гидропоника 🔸")
kategorii_menu.row("🔸 Бошки Cookies Kush 🔸")
kategorii_menu.row("🔙 Вернуться в меню 🔙")

alfa_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
alfa_menu.row("🔸 Альфа-ПВП (0,2гр) - 699р 🔸",)
alfa_menu.row("🔸 Альфа-ПВП (0,5гр) - 1299р 🔸",)
alfa_menu.row("🔸 Альфа-ПВП (1гр) - 2499р 🔸")
alfa_menu.row("🔙 Назад 🔙")

gash_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
gash_menu.row("🔸 Гашиш (1гр) - 1200p 🔸",)
gash_menu.row("🔸 Гашиш (5гр) - 4400p 🔸",)
gash_menu.row("🔸 Гашиш (10гр) - 8500p 🔸")
gash_menu.row("🔙 Назад 🔙")

shish_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
shish_menu.row("🔸 Шишки (1гр) - 1100p 🔸",)
shish_menu.row("🔸 Шишки (2гр) - 2000p 🔸",)
shish_menu.row("🔸 Шишки (5гр) - 3500p 🔸",)
shish_menu.row("🔸 Шишки (10гр) - 6500p 🔸")
shish_menu.row("🔙 Назад 🔙")

amf_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
amf_menu.row("🔸 Амфетамин (1гр) - 1000p 🔸",)
amf_menu.row("🔸 Амфетамин (3гр) - 2100p 🔸",)
amf_menu.row("🔸 Амфетамин (5гр) - 3000p 🔸",)
amf_menu.row("🔸 Амфетамин (10гр) - 5500p 🔸",)
amf_menu.row("🔸 Амфетамин (10гр) - 5500p 🔸")
amf_menu.row("🔙 Назад 🔙")

mef_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
mef_menu.row("🔸 Мефедрон (1гр) - 2000p 🔸",)
mef_menu.row("🔸 Мефедрон (3гр) - 5700p 🔸")
mef_menu.row("🔙 Назад 🔙")

mdma_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
mdma_menu.row("🔸 МДМА (1гр) - 2800p 🔸",)
mdma_menu.row("🔸 МДМА (2гр) - 5600p 🔸",)
mdma_menu.row("🔸 МДМА (5гр) - 11600p 🔸")
mdma_menu.row("🔙 Назад 🔙")

koka_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
koka_menu.row("🔸 Кокаин HQ (0,3гр) - 2500p 🔸",)
koka_menu.row("🔸 Кокаин HQ (0,5гр) - 4250p 🔸",)
koka_menu.row("🔸 Кокаин HQ (1гр) - 7500p 🔸",)
koka_menu.row("🔸 Кокаин HQ (1,5гр) - 11400p 🔸",)
koka_menu.row("🔸 Кокаин MQ (1гр) - 3850p 🔸",)
koka_menu.row("🔸 Кокаин MQ (2гр) - 8650p 🔸")
koka_menu.row("🔙 Назад 🔙")

lsd_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
lsd_menu.row("🔸 LSD(180мкг) (2шт) - 1700р 🔸",)
lsd_menu.row("🔸 LSD(180мкг) (5шт) - 3500p 🔸",)
lsd_menu.row("🔸 LSD(180мкг) (10шт) - 7700p 🔸",)
lsd_menu.row("🔙 Назад 🔙")

met_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
met_menu.row("🔸 Метамфетамин HQ(Крис) (1гр) - 3400p 🔸",)
met_menu.row("🔸 Метамфетамин HQ(Крис) (2гр) - 6750p 🔸",)
met_menu.row("🔙 Назад 🔙")

ext_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
ext_menu.row("🔸 Экстази (Таблетки Philipp Plein) (3шт) - 1350р 🔸",)
ext_menu.row("🔸 Экстази (Таблетки Philipp Plein) (6шт) - 4000р 🔸",)
ext_menu.row("🔙 Назад 🔙")

but_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
but_menu.row("🔸 Бутират (30 мл) - 600р 🔸",)
but_menu.row("🔸 Бутират (100 мл) - 1950р 🔸",)
but_menu.row("🔙 Назад 🔙")

gidro_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
gidro_menu.row("🔸 Гидропоника [The Cake] (1гр) - 2350р 🔸",)
gidro_menu.row("🔸 Гидропоника [The Cake] (2гр) - 4650р 🔸",)
gidro_menu.row("🔸 Гидропоника [The Cake] (2,5гр) - 5285р 🔸",)
gidro_menu.row("🔙 Назад 🔙")

bosh_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
bosh_menu.row("🔸 Бошки Cookies Kush (1гр) - 1800р 🔸",)
bosh_menu.row("🔸 Бошки Cookies Kush (3гр) - 5350р 🔸",)
bosh_menu.row("🔸 Бошки Cookies Kush (5гр) - 8900р 🔸",)
bosh_menu.row("🔙 Назад 🔙")

#Help
help_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
help_menu.row("📨 Информация 📨", "❓ Как совершить покупку ❓")
help_menu.row("🔜 Перейти к выбору товара 🔜")
help_menu.row("🔙 Вернуться к выбору города 🔙", "😍 Акции 😍")

#Start
start_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
start_menu.row("📨 Информация 📨", "❓ Как совершить покупку ❓")
start_menu.row("📦 Купить товар 📦")
start_menu.row("🤑 Скидки 🤑", "👨‍👨‍👦 Реферальная система 👨‍👨‍👦")


#Buy Menu
buy_menu = telebot.types.ReplyKeyboardMarkup(True, True, True)
buy_menu.row("🧮 Проверить оплату 🧮",)
buy_menu.row("🔙 Вернуться к выбору города 🔙", "🔙 Вернуться к выбору товара 🔙",)
buy_menu.row("🔙 Вернуться в меню 🔙")
#города

#moscow
moscow_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
moscow_menu.add(
"🔸 САО 🔸",
"🔸 ЦАО 🔸",
"🔸 ЮАО 🔸",
"🔸 ЮВАО 🔸",
"🔸 ЗАО 🔸",
"🔙 Вернуться в меню 🔙"
)
#SPB
spb_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
spb_menu.add(
"🔸 Василеостровский 🔸",
"🔸 Выборгский 🔸",
"🔸 Калининский 🔸",
"🔸 Кировский 🔸",
"🔸 Колпинский 🔸",
"🔸 Красногвардейский 🔸",
"🔸 Красносельский 🔸",
"🔸 Курортный 🔸",
"🔸 Кронштадтский 🔸",
"🔸 Московский 🔸",
"🔸 Невский 🔸",
"🔸 Петроградский 🔸",
"🔸 Петродворцовый 🔸",
"🔸 Приморский 🔸",
"🔸 Пушкинский 🔸",
"🔸 Фрунзенский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Тула
tula_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
tula_menu.add(
"🔸 Зареченский 🔸",
"🔸 Привокзальный 🔸",
"🔸 Пролетарский 🔸",
"🔸 Советский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Екатеринбург
ekb_menu= telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
ekb_menu.add(
"🔸 Верх-Исетский 🔸",
"🔸 Железнодорожный 🔸",
"🔸 Кировский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Ордожиникидзевский 🔸",
"🔸 Чкаловский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Барнаул
barnaul_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
barnaul_menu.add(
"🔸 Железнодорожный 🔸",
"🔸 Индустриальный 🔸",
"🔸 Ленинский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Томск
tomsk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
tomsk_menu.add(
"🔸 Кировский 🔸",
"🔸 Ленинский 🔸",
"🔸 Октрябрьский 🔸",
"🔸 Советский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Тюмень
tumen_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
tumen_menu.add(
"🔸 Восточный 🔸",
"🔸 Калининский 🔸",
"🔸 Ленинский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Нижний Новгород
nn_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
nn_menu.add(
"🔸 Автозаводский 🔸",
"🔸 Канавинский 🔸",
"🔸 Ленинский 🔸",
"🔸 Московский 🔸",
"🔸 Нижегородский 🔸",
"🔸 Приокский 🔸",
"🔸 Советский 🔸",
"🔸 Сормовский 🔸",
"🔙 Вернуться в меню 🔙"
)
# Самара
samara_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
samara_menu.add(
"🔸 Куйбышевский 🔸",
"🔸 Самарский 🔸",
"🔸 Ленинский",
"🔸 Железнодорожный 🔸",
"🔸 Октябрьский 🔸",
"🔸 Промышленный 🔸",
"🔸 Кировский 🔸",
"🔸 Красноглинский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Омск
omsk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
omsk_menu.add(
"🔸 Советский 🔸",
"🔸 Центральный 🔸",
"🔸 Кировский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Ленинский 🔸",
"🔙 Вернуться в меню 🔙"
)

#Саратов
saratov_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
saratov_menu.add(
"🔸 Заводской район 🔸",
"🔸 Октрябрьский 🔸",
"🔸 Фрунзенский 🔸",
"🔸 Волжский 🔸",
"🔸 Ленинский 🔸",
"🔸 Кировский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Краснодар
krasnodar_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
krasnodar_menu.add(
"🔸 Центральный 🔸",
"🔸 ЖМР 🔸",
"🔸 СМР 🔸",
"🔸 ЗИП 🔸",
"🔸 РИП 🔸",
"🔸 ШМР 🔸",
"🔸 ЮМР 🔸",
"🔸 КМР 🔸",
"🔸 ПМР 🔸",
"🔸 ГМР 🔸",
"🔸 ЧМР 🔸",
"🔙 Вернуться в меню 🔙"
)

#Воронеж
voronej_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
voronej_menu.add(
"🔸 Железнодорожный 🔸",
"🔸 Коминтерновский 🔸",
"🔸 Левобережный 🔸",
"🔸 Ленинский 🔸",
"🔸 Советский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Казань
kasan_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
kasan_menu.add(
"🔸 Авиастроительный 🔸",
"🔸 Вахитовский 🔸",
"🔸 Кировский 🔸",
"🔸 Московский 🔸",
"🔸 Ново-Савиновский 🔸",
"🔸 Приволжский 🔸",
"🔸 Советский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Пермь
perm_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
perm_menu.add(
"🔸 Дзержинский 🔸",
"🔸 Индустриальный 🔸",
"🔸 Кировский 🔸",
"🔸 Ленинский 🔸",
"🔸 Мотовилихинский 🔸",
"🔸 Орджоникидзевский 🔸",
"🔸 Свердловский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Новосибирск
ns_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
ns_menu.add(
"🔸 Дзержинский 🔸",
"🔸 Железнодорожный 🔸",
"🔸 Заельцовский 🔸",
"🔸 Калининский 🔸",
"🔸 Кировский 🔸",
"🔸 Ленинский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Первомайский 🔸",
"🔸 Советский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Челябинск
chel_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
chel_menu.add(
"🔸 Калининский 🔸",
"🔸 Курчатовский 🔸",
"🔸 Ленинский 🔸",
"🔸 Металлургический 🔸",
"🔸 Советский 🔸",
"🔸 Тракторозаводской 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Иваново
iva_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
iva_menu.add(
"🔸 Ленинский 🔸",
"🔸 Фрунзенский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Советский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Волгоград
volga_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
volga_menu.add(
"🔸 Тракторозаводской 🔸",
"🔸 Краснооктябрьский 🔸",
"🔸 Дзержинский 🔸",
"🔸 Центральный 🔸",
"🔸 Ворошиловский 🔸",
"🔸 Советский 🔸",
"🔸 Кировский 🔸",
"🔸 Красноармейский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Красноярск
krasno_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
krasno_menu.add(
"🔸 Железнодорожный 🔸",
"🔸 Кировский 🔸",
"🔸 Ленинский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Свердловский 🔸",
"🔸 Советский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Тольятти
tol_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
tol_menu.add(
"🔸 Автозаводский 🔸",
"🔸 Комсомольский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Уфа
ufa_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
ufa_menu.add(
"🔸 Дёмский 🔸",
"🔸 Калининский 🔸",
"🔸 Ленинский 🔸",
"🔸 Кировский 🔸",
"🔸 Ленинский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Орджоникидзевский 🔸",
"🔸 Советский 🔸",
"🔙 Вернуться в меню 🔙"
)
#астрахань
astr_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
astr_menu.add(
"🔸 Кировский 🔸",
"🔸 Трусовский 🔸",
"🔸 Приволжский 🔸",
"🔸 Ближний пригород 🔸",
"🔙 Вернуться в меню 🔙"
)
#великийновгород
vn_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
vn_menu.add(
"🔸 Восток 🔸",
"🔸 Север 🔸",
"🔸 Запад 🔸",
"🔸 северо - запад 🔸",
"🔙 Вернуться в меню 🔙"
)
#владивосток
vlad_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
vlad_menu.add(
"🔸 Первомайский 🔸",
"🔸 Ленинский 🔸",
"🔸 Первореченский 🔸",
"🔸 Советский 🔸",
"🔙 Вернуться в меню 🔙"
)
#вологда
vologda_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
vologda_menu.add(
"🔸 По городу 🔸",
"🔸 Водники 🔸",
"🔸 Зареье 🔸",
"🔸 Завокзальный 🔸",
"🔙 Вернуться в меню 🔙"
)
#йошкар
ioshka_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
ioshka_menu.add(
"🔸 Октябрьский 🔸",
"🔸 Нагорный 🔸",
"🔸 Северный 🔸",
"🔸 Юбилейный 🔸",
"🔙 Вернуться в меню 🔙"
)
#калининград
kalik_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
kalik_menu.add(
"🔸 Балтийский 🔸",
"🔸 Московский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#калуга
kaluga_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
kaluga_menu.add(
"🔸 Московский округ 🔸",
"🔸 Октябрьский округ 🔸",
"🔸 Центр 🔸",
"🔸 Кировский 🔸",
"🔸 Ближний пригород +5 км 🔸",
"🔙 Вернуться в меню 🔙"
)
#кемерово
kemerovo_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
kemerovo_menu.add(
"🔸 Южный 🔸",
"🔸 Центр 🔸",
"🔸 Кировский 🔸",
"🔙 Вернуться в меню 🔙"
)
#киров
kirov_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
kirov_menu.add(
"🔸 ТЭЦ 🔸",
"🔸 Филейка 🔸",
"🔸 Жд вокзал 🔸",
"🔸 В черте города 🔸",
"🔙 Вернуться в меню 🔙"
)
#курск
kursk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
kursk_menu.add(
"🔸 Жд 🔸",
"🔸 Сеймский 🔸",
"🔸 Центральный 🔸",
"🔸 Пригород 🔸",
"🔙 Вернуться в меню 🔙"
)
#мурманск
murmansk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
murmansk_menu.add(
"🔸 Октябрьский 🔸",
"🔸 Первомайский 🔸",
"🔸 Петушинка 🔸",
"🔸 Центр 🔸",
"🔙 Вернуться в меню 🔙"
)
#набережныечлены
nc_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
nc_menu.add(
"🔸 Тогаевский карьер 🔸",
"🔸 36 комплекс 🔸",
"🔸 Энергорайон 🔸",
"🔸 10 комплекс 🔸",
"🔙 Вернуться в меню 🔙"
)
#нижневарторк
nijnevatorsk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
nijnevatorsk_menu.add(
"🔸 Молодежный 🔸",
"🔸 Северный 🔸",
"🔸 Центральный 🔸",
"🔸 По городу 🔸",
"🔙 Вернуться в меню 🔙"
)
#новокузн
novokuzn_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
novokuzn_menu.add(
"🔸 Заводской 🔸",
"🔸 Орджоникидзе 🔸",
"🔸 Центр 🔸",
"🔸 В городе 🔸",
"🔙 Вернуться в меню 🔙"
)
#оренбург
orenburg_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
orenburg_menu.add(
"🔸 Степной 🔸",
"🔸 Центральный 🔸",
"🔸 23мкр 🔸",
"🔸 В черте города 🔸",
"🔸 Восточный 🔸",
"🔙 Вернуться в меню 🔙"
)
#орел
orel_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
orel_menu.add(
"🔸 Северный 🔸",
"🔸 Советский 🔸",
"🔸 Лужки 🔸",
"🔸 Гринн 🔸",
"🔙 Вернуться в меню 🔙"
)
#пенза
penza_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
penza_menu.add(
"🔸 Жд 🔸",
"🔸 Ленинский 🔸",
"🔸 Первомайский 🔸",
"🔸 Октябрьский 🔸",
"🔙 Вернуться в меню 🔙"
)
#ростов
rostov_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
rostov_menu.add(
"🔸 Кировский 🔸",
"🔸 Ленинский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Первомайский 🔸",
"🔙 Вернуться в меню 🔙"
)
#саранск
saransk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
saransk_menu.add(
"🔸 Октябрьский 🔸",
"🔸 Ленинский 🔸",
"🔸 Пролетарский 🔸",
"🔙 Вернуться в меню 🔙"
)
#ижевск
ijevsk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
ijevsk_menu.add(
"🔸 Первомайский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Ленинский 🔸",
"🔸 Индустриальный 🔸",
"🔙 Вернуться в меню 🔙"
)
#ульяновск
ulyanovsk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
ulyanovsk_menu.add(
"🔸 Ленинский 🔸",
"🔸 Заволжский 🔸",
"🔸 Железнодорожный 🔸",
"🔸 В черте города 🔸",
"🔙 Вернуться в меню 🔙"
)
#иркутск
irkutsk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
irkutsk_menu.add(
"🔸 Кировский 🔸",
"🔸 Куйбышевский 🔸",
"🔸 Ленинский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Свердловский 🔸",
"🔙 Вернуться в меню 🔙"
)
#хабаровск
habarovsk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
habarovsk_menu.add(
"🔸 Краснофлотский 🔸",
"🔸 Кировский 🔸",
"🔸 Центральный 🔸",
"🔸 Железнодорожный 🔸",
"🔸 Индустриальный 🔸",
"🔙 Вернуться в меню 🔙"
)
#ярик
yaroslavl_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
yaroslavl_menu.add(
"🔸 Дзержинский 🔸",
"🔸 Ленинский 🔸",
"🔸 Кировский 🔸",
"🔸 Фрунзенский 🔸",
"🔙 Вернуться в меню 🔙"
)
#рязань
ryazan_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
ryazan_menu.add(
"🔸 Железнодорожный 🔸",
"🔸 Московский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Советский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Липецк
lipeck_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
lipeck_menu.add(
"🔸 Левобережный район 🔸",
"🔸 Октябрьский район 🔸",
"🔸 Правобережный район 🔸",
"🔸 Советский район 🔸",
"🔙 Вернуться в меню 🔙"
)
#Чебоксары
ceboksar_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
ceboksar_menu.add(
"🔸 Железнодорожный 🔸",
"🔸 Московский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Советский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Ставрополь
stavropol_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
stavropol_menu.add(
"🔸 Калининский район 🔸",
"🔸 Ленинский район 🔸",
"🔸 Московский район 🔸",
"🔸 по всему городу 🔸",
"🔙 Вернуться в меню 🔙"
)
#ставрополь
sevastopol_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
sevastopol_menu.add(
"🔸 Ленинский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Калининский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Сочи
soci_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
soci_menu.add(
"🔸 Адлерский 🔸",
"🔸 Хостинский 🔸",
"🔸 Лазоревский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Тверь
tver_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
tver_menu.add(
"🔸 Заволжский 🔸",
"🔸 Московский 🔸",
"🔸 Пролетарский 🔸",
"🔸 Центральный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Брянск
bransk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
bransk_menu.add(
"🔸 Бежитский 🔸",
"🔸 Советский 🔸",
"🔸 Фокинский 🔸",
"🔸 Володарский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Белгород
belgorod_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
belgorod_menu.add(
"🔸 Восточный 🔸",
"🔸 Западный 🔸",
"🔸 По всему городу 🔸",
"🔙 Вернуться в меню 🔙"
)
#Владиимр
vladimir_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
vladimir_menu.add(
"🔸 Ленинский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Фрунзенский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Чита
cida_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
cida_menu.add(
"🔸 Черновский 🔸",
"🔸 Центральный 🔸",
"🔸 Железнодорожный 🔸",
"🔙 Вернуться в меню 🔙"
)
#Смоленск
smolensk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
smolensk_menu.add(
"🔸 Ленинский 🔸",
"🔸 Промышленный 🔸",
"🔸 Заднепровский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Якутск
yakutsk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
yakutsk_menu.add(
"🔸 Автодорожный округ 🔸",
"🔸 Гагаринский округ 🔸",
"🔸 Октябрьский округ 🔸",
"🔙 Вернуться в меню 🔙"
)
#Череповец
cerepovec_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
cerepovec_menu.add(
"🔸 Индустриальный 🔸",
"🔸 Заягорбский 🔸",
"🔸 Зашекснинский 🔸",
"🔸 Фанера 🔸",
"🔙 Вернуться в меню 🔙"
)
#Тамбов
tambov_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
tambov_menu.add(
"🔸 Ленинский 🔸",
"🔸 Октябрьский 🔸",
"🔸 Севетский 🔸",
"🔙 Вернуться в меню 🔙"
)
#Петрозаводск
petrozavodsk_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
petrozavodsk_menu.add(
"🔸 Голиковка 🔸",
"🔸 Древлянка 🔸",
"🔸 Железнодорожный 🔸",
"🔸 Зарека 🔸",
"🔙 Вернуться в меню 🔙"
)
#Абакан
abokan_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
abokan_menu.add(
"🔸 МПС 🔸",
"🔸 Южный 🔸",
"🔸 Красный Абакан 🔸",
"🔸 Гавань 🔸",
"🔙 Вернуться в меню 🔙"
)
#Южно
ysahal_menu = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
ysahal_menu.add(
"🔸 Марковка 🔸",
"🔸 Змеевка 🔸",
"🔸 Зима 🔸",
"🔙 Вернуться в меню 🔙"
)


